# SQL- Data definiton Language (DDL)
Tabellen erstellen und die Struktur ändern wie z.B : Attribute ändern/löschen/neu ... 

#### Befehle 
- CREATE TABLE
- ALTER TABLE
- DROP TABLE

#### Datentypen 
Siehe ERM skript Nummer 39

In [21]:
import sqlite3
import pandas as pd
conn = sqlite3.connect(":memory:")
cur = conn.cursor()

cur.execute("""
CREATE TABLE schueler(
            schuelerID INTEGER PRIMARY KEY,
            name VARCHAR(50) NOT NULL,
            "alter" INTEGER NOT NULL);
            """)

comand = "PRAGMA TABLE_INFO('schueler');"

print(cur.execute(comand).fetchall())

pd.read_sql(comand, conn)

cur.execute("""ALTER TABLE schueler 
            ADD klasse VARCHAR(10) NOT NULL;
            """)

# cur.execute("""DROP TABLE schueler;""")

cur.execute("""
INSERT INTO schueler (name, "alter", klasse) VALUES 
            ('tim', 16, '4a'),
            ('lisa', 17, '4b'),
            ('anna', 16, '4a'),
            ('paul', 15, '3c');
""")


cur.execute("SELECT * FROM schueler").fetchall()

pd.read_sql("SELECT * FROM schueler", conn)


cur.execute("""ALTER TABLE schueler 
            RENAME COLUMN 'alter' TO age;
            """)


cur.execute("""ALTER TABLE schueler 
            DROP COLUMN klasse;
            """)

pd.read_sql("SELECT * FROM schueler", conn)

[(0, 'schuelerID', 'INTEGER', 0, None, 1), (1, 'name', 'VARCHAR(50)', 1, None, 0), (2, 'alter', 'INTEGER', 1, None, 0)]

   schuelerID  name  age
0           1   tim   16
1           2  lisa   17
2           3  anna   16
3           4  paul   15

### Aufgabe
1. Erstelle die `people` Tabelle.
   
| **CID** | **NAME** | **TYPE**| **NOTNULL** | **DFLT VALUE** | **PK** |
|-----|-----------|---------|---------|------------|----|
| 0   | id        | INTEGER | 0       | NULL       | 1  |
| 1   | handle    | TEXT    | 0       | NULL       | 0  |
| 2   | name      | TEXT    | 0       | NULL       | 0  |
| 3   | age       | INTEGER | 0       | NULL       | 0  |
| 4   | balance   | INTEGER | 0       | NULL       | 0  |
| 5   | is_admin  | BOOLEAN | 0       | NULL       | 0  |

2. Die Tabelle `people` soll in `users` umbenannt werden.
3. Die Spalte `handle` soll in `username` umbenannt werden.
   
|   cid | name     | type    |   notnull | dflt_value   |   pk |
|------:|:---------|:--------|----------:|:-------------|-----:|
|     0 | id       | INTEGER |         0 |              |    1 |
|     1 | username | TEXT    |         0 |              |    0 |
|     2 | name     | TEXT    |         0 |              |    0 |
|     3 | age      | INTEGER |         0 |              |    0 |
|     4 | balance  | INTEGER |         0 |              |    0 |
|     5 | is_admin | BOOLEAN |         0 |              |    0 |

4. Eine neue Spalte `password` vom Typ `TEXT` soll hinzugefügt werden.
   
|   cid | name     | type    |   notnull | dflt_value   |   pk |
|------:|:---------|:--------|----------:|:-------------|-----:|
|     0 | id       | INTEGER |         0 |              |    1 |
|     1 | username | TEXT    |         0 |              |    0 |
|     2 | name     | TEXT    |         0 |              |    0 |
|     3 | age      | INTEGER |         0 |              |    0 |
|     4 | balance  | INTEGER |         0 |              |    0 |
|     5 | is_admin | BOOLEAN |         0 |              |    0 |
|     6 | password | TEXT    |         0 |              |    0 | 

5. Spalte `is_admin` soll gelöscht werden.
   
|   cid | name     | type    |   notnull | dflt_value   |   pk |
|------:|:---------|:--------|----------:|:-------------|-----:|
|     0 | id       | INTEGER |         0 |              |    1 |
|     1 | username | TEXT    |         0 |              |    0 |
|     2 | name     | TEXT    |         0 |              |    0 |
|     3 | age      | INTEGER |         0 |              |    0 |
|     4 | balance  | INTEGER |         0 |              |    0 |
|     5 | password | TEXT    |         0 |              |    0 |

In [36]:
import sqlite3
import pandas as pd
conn = sqlite3.connect(":memory:")
cur = conn.cursor()


cur.execute("""
CREATE TABLE people(
            ID INTEGER PRIMARY KEY,
            HANDLE TEXT,
            NAME TEXT,
            AGE INTEGER,
            BALANCE INTEGER,
            IS_ADMIN BOOLEAN);
            
            """)

cur.execute("""ALTER TABLE people 
            RENAME to users;
            """)
           
cur.execute("""ALTER TABLE users  
            RENAME COLUMN HANDLE TO username;
            """)

cur.execute("ALTER TABLE users ADD COLUMN passsword VARCHAR(50);")

cur.execute("ALTER TABLE users DROP COLUMN IS_ADMIN;")

pd.read_sql("PRAGMA TABLE_INFO('users');", conn)

   cid       name         type  notnull dflt_value  pk
0    0         ID      INTEGER        0       None   1
1    1   username         TEXT        0       None   0
2    2       NAME         TEXT        0       None   0
3    3        AGE      INTEGER        0       None   0
4    4    BALANCE      INTEGER        0       None   0
5    5  passsword  VARCHAR(50)        0       None   0